Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/dns_client.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
    dns_client.c

  Summary:
    Module for Microchip TCP/IP Stack
     -Provides hostname to IP address translation
     -Reference: RFC 1035

  Description:
    Domain Name System (DNS) Client

 *******************************************************************************/

//DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright (c) <2014> released Microchip Technology Inc.  All rights reserved.

 * Confirmed By jinzhouyun, Date 2016.10.01
 *******************************************************************************/
//DOM-IGNORE-END

#define __DNS_C_

#include <xc.h>
#include "tcpip/tcpip.h"

#if defined(STACK_USE_DNS_CLIENT)

/***************************************************************************
  Section:
    Constants and Global Variables
 ***************************************************************************/

#define DNS_PORT  53u // Default port for DNS resolutions
#define DNS_TIMEOUT  (TICK_SECOND * 1) // Elapsed time after which a DNS resolution is considered to have timed out

static UDP_SOCKET MySocket = INVALID_UDP_SOCKET; // UDP socket to use for DNS queries
static uint8_t *DNSHostName; // Host name in RAM to look up
static ROM uint8_t *DNSHostNameROM; // Host name in ROM to look up
static uint8_t RecordType; // Record type being queried
static NODE_INFO ResolvedInfo; // Node information about the resolved node

// Semaphore flags for the DNS module
static union {
    uint8_t Val;

    struct {
        unsigned char DNSInUse : 1; // Indicates the DNS module is in use
        unsigned char AddressValid : 1; // Indicates that the address resolution is valid and complete
        unsigned char filler : 6;
    } bits;
} Flags = {0x00};

// State machine for a DNS query
static enum {
    DNS_START = 0, // Initial state to reset client state variables
    DNS_ARP_START_RESOLVE, // Send ARP resolution of DNS server or gateway MAC address
    DNS_ARP_RESOLVE, // Wait for response to ARP request
    DNS_OPEN_SOCKET, // Open UDP socket
    DNS_QUERY, // Send DNS query to DNS server
    DNS_GET_RESULT, // Wait for response from DNS server
    DNS_FAIL, // ARP or DNS server not responding
    DNS_DONE // DNS query is finished
} smDNS = DNS_DONE;

// Structure for the DNS header
typedef struct {
    TCPIP_UINT16_VAL TransactionID;
    TCPIP_UINT16_VAL Flags;
    TCPIP_UINT16_VAL Questions;
    TCPIP_UINT16_VAL Answers;
    TCPIP_UINT16_VAL AuthoritativeRecords;
    TCPIP_UINT16_VAL AdditionalRecords;
} DNS_HEADER;

typedef struct {
    // Response name is first, but it is variable length and must be retrieved using the DNSDiscardName() function
    TCPIP_UINT16_VAL ResponseType;
    TCPIP_UINT16_VAL ResponseClass;
    TCPIP_UINT32_VAL ResponseTTL;
    TCPIP_UINT16_VAL ResponseLen;
} DNS_ANSWER_HEADER;

/***************************************************************************
  Section:
    Function Prototypes
 ***************************************************************************/
static void DNSPutString(uint8_t *String);
static void DNSDiscardName(void);

#if defined(__XC8)
static void DNSPutROMString(ROM uint8_t *String);
#else
// Non-ROM alias for C30/C32
#define DNSPutROMString(a)  DNSPutString((uint8_t *)a)
#endif

/***************************************************************************
  Function:
    bool DNSInit(void)

  Summary:
    DNS module initialization function.

  Description:
    This function does not do anything when the stack is initialized for the
    first time. The real work it does is to clean DNS semaphore during Wi-Fi
    Soft AP redirection. So it is actually a re-initialization function.

  Precondition:
    Stack is initialized.

  Parameters:
    None

  Return Values:
    None

  Remarks:
    None

 ***************************************************************************/
void DNSInit(void)
{
    if (AppConfig.hibernateFlag) {
        DNSBeginUsage();
        DNSDiscardName();
        DNSEndUsage();
    }
}

/***************************************************************************
  Function:
    bool DNSBeginUsage(void)

  Summary:
    Claims access to the DNS module.

  Description:
    This function acts as a semaphore to obtain usage of the DNS module.
    Call this function and ensure that it returns true before calling any
    other DNS APIs.  Call DNSEndUsage when this application no longer
    needs the DNS module so that other applications may make use of it.

  Precondition:
    Stack is initialized.

  Parameters:
    None

  Return Values:
    true - No other DNS resolutions are in progress and the calling
            application has sucessfully taken ownership of the DNS module
    false - The DNS module is currently in use.  Yield to the stack and
            attempt this call again later.

  Remarks:
    Ensure that DNSEndUsage is always called once your application has
    obtained control of the DNS module.  If this is not done, the stack
    will hang for all future applications requiring DNS access.
 ***************************************************************************/
bool DNSBeginUsage(void)
{
    if (Flags.bits.DNSInUse)
        return false;

    Flags.bits.DNSInUse = true;
    return true;
}

/***************************************************************************
  Function:
    bool DNSEndUsage(void)

  Summary:
    Releases control of the DNS module.

  Description:
    This function acts as a semaphore to obtain usage of the DNS module.
    Call this function when this application no longer needs the DNS
    module so that other applications may make use of it.

  Precondition:
    DNSBeginUsage returned true on a previous call.

  Parameters:
    None

  Return Values:
    true - The address to the host name was successfully resolved.
    false - The DNS failed or the address does not exist.

  Remarks:
    Ensure that DNSEndUsage is always called once your application has
    obtained control of the DNS module.  If this is not done, the stack
    will hang for all future applications requiring DNS access.
 ***************************************************************************/
bool DNSEndUsage(void)
{
    if (MySocket != INVALID_UDP_SOCKET) {
        UDPClose(MySocket);
        MySocket = INVALID_UDP_SOCKET;
    }
    smDNS = DNS_DONE;
    Flags.bits.DNSInUse = false;

