Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/dns_client.c
    return Flags.bits.AddressValid;
}

/***************************************************************************
  Function:
    void DNSResolve(uint8_t *Hostname, uint8_t Type)

  Summary:
    Begins resolution of an address.

  Description:
    This function attempts to resolve a host name to an IP address.  When
    called, it starts the DNS state machine.  Call DNSIsResolved repeatedly
    to determine if the resolution is complete.

    Only one DNS resoultion may be executed at a time.  The Hostname must
    not be modified in memory until the resolution is complete.

  Precondition:
    DNSBeginUsage returned true on a previous call.

  Parameters:
    Hostname - A pointer to the null terminated string specifiying the
        host for which to resolve an IP.
    RecordType - DNS_TYPE_A or DNS_TYPE_MX depending on what type of
        record resolution is desired.

  Returns:
    None

  Remarks:
    This function requires access to one UDP socket.  If none are available,
    MAX_UDP_SOCKETS may need to be increased.
 ***************************************************************************/
void DNSResolve(uint8_t *Hostname, uint8_t Type)
{
    if (StringToIPAddress(Hostname, &ResolvedInfo.IPAddr)) {
        Flags.bits.AddressValid = true;
        smDNS = DNS_DONE;
    } else {
        DNSHostName = Hostname;
        DNSHostNameROM = NULL;
        smDNS = DNS_START;
        RecordType = Type;
        Flags.bits.AddressValid = false;
    }
}

/***************************************************************************
  Function:
    void DNSResolveROM(ROM uint8_t *Hostname, uint8_t Type)

  Summary:
    Begins resolution of an address.

  Description:
    This function attempts to resolve a host name to an IP address.  When
    called, it starts the DNS state machine.  Call DNSIsResolved repeatedly
    to determine if the resolution is complete.

    Only one DNS resoultion may be executed at a time.  The Hostname must
    not be modified in memory until the resolution is complete.

  Precondition:
    DNSBeginUsage returned true on a previous call.

  Parameters:
    Hostname - A pointer to the null terminated string specifiying the
        host for which to resolve an IP.
    RecordType - DNS_TYPE_A or DNS_TYPE_MX depending on what type of
        record resolution is desired.

  Returns:
    None

  Remarks:
    This function requires access to one UDP socket.  If none are available,
    MAX_UDP_SOCKETS may need to be increased.

    This function is aliased to DNSResolve on non-PIC18 platforms.
 ***************************************************************************/
#if defined(__XC8)
void DNSResolveROM(ROM uint8_t *Hostname, uint8_t Type)
{
    if (ROMStringToIPAddress(Hostname, &ResolvedInfo.IPAddr)) {
        Flags.bits.AddressValid = true;
        smDNS = DNS_DONE;
    } else {
        DNSHostName = NULL;
        DNSHostNameROM = Hostname;
        smDNS = DNS_START;
        RecordType = Type;
        Flags.bits.AddressValid = false;
    }
}
#endif

/*****************************************************************************
  Function:
    bool DNSIsResolved(IP_ADDR *HostIP)

  Summary:
    Determines if the DNS resolution is complete and provides the IP.

  Description:
    Call this function to determine if the DNS resolution of an address has
    been completed.  If so, the resolved address will be provided in HostIP.

  Precondition:
    DNSResolve or DNSResolveROM has been called.

  Parameters:
    HostIP - A pointer to an IP_ADDR structure in which to store the
        resolved IP address once resolution is complete.

  Return Values:
    true - The DNS client has obtained an IP, or the DNS process
        has encountered an error.  HostIP will be 0.0.0.0 on error.  Possible
        errors include server timeout (i.e. DNS server not available), hostname
        not in the DNS, or DNS server errors.
    false - The resolution process is still in progress.
 ***************************************************************************/
bool DNSIsResolved(IP_ADDR *HostIP)
{
    static uint32_t StartTime;
    static TCPIP_UINT16_VAL SentTransactionID __attribute__((persistent));
    static uint8_t vARPAttemptCount;
    static uint8_t vDNSAttemptCount;
    uint8_t i;
    TCPIP_UINT16_VAL w;
    DNS_HEADER DNSHeader;
    DNS_ANSWER_HEADER DNSAnswerHeader;

    switch (smDNS) {
    case DNS_START:
        vARPAttemptCount = 0;
        vDNSAttemptCount = 0;
        // No break;

    case DNS_ARP_START_RESOLVE:
        ARPResolve(&AppConfig.PrimaryDNSServer);
        vARPAttemptCount++;
        StartTime = TickGet();
        smDNS = DNS_ARP_RESOLVE;
        break;

    case DNS_ARP_RESOLVE:
        if (!ARPIsResolved(&AppConfig.PrimaryDNSServer, &ResolvedInfo.MACAddr)) {
            if (TickGet() - StartTime > DNS_TIMEOUT)
                smDNS = (vARPAttemptCount >= 3u) ? DNS_FAIL : DNS_ARP_START_RESOLVE;
            break;
        }
        ResolvedInfo.IPAddr.Val = AppConfig.PrimaryDNSServer.Val;
        smDNS = DNS_OPEN_SOCKET;
        // No break: DNS_OPEN_SOCKET is the correct next state

    case DNS_OPEN_SOCKET:
        //MySocket = UDPOpen(0, &ResolvedInfo, DNS_PORT);

        MySocket = UDPOpenEx((uint32_t) (PTR_BASE) & ResolvedInfo, UDP_OPEN_NODE_INFO, 0, DNS_PORT);
        if (MySocket == INVALID_UDP_SOCKET)
            break;

        smDNS = DNS_QUERY;
        // No need to break, we can immediately start resolution

    case DNS_QUERY:
        if (!UDPIsPutReady(MySocket))
            break;

        // Put DNS query here
        SentTransactionID.Val++;
        UDPPut(SentTransactionID.v[1]); // User chosen transaction ID
        UDPPut(SentTransactionID.v[0]);
        UDPPut(0x01); // Standard query with recursion
        UDPPut(0x00);
        UDPPut(0x00); // 0x0001 questions
        UDPPut(0x01);
        UDPPut(0x00); // 0x0000 answers
        UDPPut(0x00);
        UDPPut(0x00); // 0x0000 name server resource records
        UDPPut(0x00);
        UDPPut(0x00); // 0x0000 additional records
        UDPPut(0x00);

        // Put hostname string to resolve
        if (DNSHostName)
            DNSPutString(DNSHostName);
        else
            DNSPutROMString(DNSHostNameROM);

