Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/dns_client.c
        UDPPut(0x00); // Type: DNS_TYPE_A A (host address) or DNS_TYPE_MX for mail exchange
        UDPPut(RecordType);
        UDPPut(0x00); // Class: IN (Internet)
        UDPPut(0x01);

        UDPFlush();
        StartTime = TickGet();
        smDNS = DNS_GET_RESULT;
        break;

    case DNS_GET_RESULT:
        if (!UDPIsGetReady(MySocket)) {
            if (TickGet() - StartTime > DNS_TIMEOUT)
                smDNS = DNS_FAIL;
            break;
        }

        // Retrieve the DNS header and de-big-endian it
        UDPGet(&DNSHeader.TransactionID.v[1]);
        UDPGet(&DNSHeader.TransactionID.v[0]);

        // Throw this packet away if it isn't in response to our last query
        if (DNSHeader.TransactionID.Val != SentTransactionID.Val) {
            UDPDiscard();
            break;
        }

        UDPGet(&DNSHeader.Flags.v[1]);
        UDPGet(&DNSHeader.Flags.v[0]);
        UDPGet(&DNSHeader.Questions.v[1]);
        UDPGet(&DNSHeader.Questions.v[0]);
        UDPGet(&DNSHeader.Answers.v[1]);
        UDPGet(&DNSHeader.Answers.v[0]);
        UDPGet(&DNSHeader.AuthoritativeRecords.v[1]);
        UDPGet(&DNSHeader.AuthoritativeRecords.v[0]);
        UDPGet(&DNSHeader.AdditionalRecords.v[1]);
        UDPGet(&DNSHeader.AdditionalRecords.v[0]);

        // Remove all questions (queries)
        while (DNSHeader.Questions.Val--) {
            DNSDiscardName();
            UDPGet(&w.v[1]); // Question type
            UDPGet(&w.v[0]);
            UDPGet(&w.v[1]); // Question class
            UDPGet(&w.v[0]);
        }

        // Scan through answers
        while (DNSHeader.Answers.Val--) {
            DNSDiscardName(); // Throw away response name
            UDPGet(&DNSAnswerHeader.ResponseType.v[1]); // Response type
            UDPGet(&DNSAnswerHeader.ResponseType.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseClass.v[1]); // Response class
            UDPGet(&DNSAnswerHeader.ResponseClass.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[3]); // Time to live
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[2]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[1]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseLen.v[1]); // Response length
            UDPGet(&DNSAnswerHeader.ResponseLen.v[0]);

            // Make sure that this is a 4 byte IP address, response type A or MX, class 1
            // Check if this is Type A or MX
            if (DNSAnswerHeader.ResponseType.Val == 0x0001u &&
                    DNSAnswerHeader.ResponseClass.Val == 0x0001u && // Internet class
                    DNSAnswerHeader.ResponseLen.Val == 0x0004u) {
                Flags.bits.AddressValid = true;
                UDPGet(&ResolvedInfo.IPAddr.v[0]);
                UDPGet(&ResolvedInfo.IPAddr.v[1]);
                UDPGet(&ResolvedInfo.IPAddr.v[2]);
                UDPGet(&ResolvedInfo.IPAddr.v[3]);
                goto DoneSearchingRecords;
            } else {
                while (DNSAnswerHeader.ResponseLen.Val--) {
                    UDPGet(&i);
                }
            }
        }

        // Remove all Authoritative Records
        while (DNSHeader.AuthoritativeRecords.Val--) {
            DNSDiscardName(); // Throw away response name
            UDPGet(&DNSAnswerHeader.ResponseType.v[1]); // Response type
            UDPGet(&DNSAnswerHeader.ResponseType.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseClass.v[1]); // Response class
            UDPGet(&DNSAnswerHeader.ResponseClass.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[3]); // Time to live
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[2]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[1]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseLen.v[1]); // Response length
            UDPGet(&DNSAnswerHeader.ResponseLen.v[0]);

            // Make sure that this is a 4 byte IP address, response type A or MX, class 1
            // Check if this is Type A
            if (DNSAnswerHeader.ResponseType.Val == 0x0001u &&
                    DNSAnswerHeader.ResponseClass.Val == 0x0001u && // Internet class
                    DNSAnswerHeader.ResponseLen.Val == 0x0004u) {
                Flags.bits.AddressValid = true;
                UDPGet(&ResolvedInfo.IPAddr.v[0]);
                UDPGet(&ResolvedInfo.IPAddr.v[1]);
                UDPGet(&ResolvedInfo.IPAddr.v[2]);
                UDPGet(&ResolvedInfo.IPAddr.v[3]);
                goto DoneSearchingRecords;
            } else {
                while (DNSAnswerHeader.ResponseLen.Val--) {
                    UDPGet(&i);
                }
            }
        }

        // Remove all Additional Records
        while (DNSHeader.AdditionalRecords.Val--) {
            DNSDiscardName(); // Throw away response name
            UDPGet(&DNSAnswerHeader.ResponseType.v[1]); // Response type
            UDPGet(&DNSAnswerHeader.ResponseType.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseClass.v[1]); // Response class
            UDPGet(&DNSAnswerHeader.ResponseClass.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[3]); // Time to live
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[2]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[1]);
            UDPGet(&DNSAnswerHeader.ResponseTTL.v[0]);
            UDPGet(&DNSAnswerHeader.ResponseLen.v[1]); // Response length
            UDPGet(&DNSAnswerHeader.ResponseLen.v[0]);

            // Make sure that this is a 4 byte IP address, response type A or MX, class 1
            // Check if this is Type A
            if (DNSAnswerHeader.ResponseType.Val == 0x0001u &&
                    DNSAnswerHeader.ResponseClass.Val == 0x0001u && // Internet class
                    DNSAnswerHeader.ResponseLen.Val == 0x0004u) {
                Flags.bits.AddressValid = true;
                UDPGet(&ResolvedInfo.IPAddr.v[0]);
                UDPGet(&ResolvedInfo.IPAddr.v[1]);
                UDPGet(&ResolvedInfo.IPAddr.v[2]);
                UDPGet(&ResolvedInfo.IPAddr.v[3]);
                goto DoneSearchingRecords;
            } else {
                while (DNSAnswerHeader.ResponseLen.Val--) {
                    UDPGet(&i);
                }
            }
        }

    DoneSearchingRecords:

        UDPDiscard();
        UDPClose(MySocket);
        MySocket = INVALID_UDP_SOCKET;
        smDNS = DNS_DONE;
        // No break, DNS_DONE is the correct step

    case DNS_DONE:
        // Return 0.0.0.0 if DNS resolution failed, otherwise return the
        // resolved IP address
        if (!Flags.bits.AddressValid)
            ResolvedInfo.IPAddr.Val = 0;
        HostIP->Val = ResolvedInfo.IPAddr.Val;
        return true;

    case DNS_FAIL:
        // If 3 attempts or more, quit
        if (vDNSAttemptCount >= 2u) {
            // Return an invalid IP address 0.0.0.0 if we can't finish ARP or DNS query step
            HostIP->Val = 0x00000000;
            return true;
        }
        vDNSAttemptCount++;

        // Swap primary and secondary DNS servers if there is a secondary DNS server programmed
        if (AppConfig.SecondaryDNSServer.Val) {
            AppConfig.PrimaryDNSServer.Val ^= AppConfig.SecondaryDNSServer.Val;
            AppConfig.SecondaryDNSServer.Val ^= AppConfig.PrimaryDNSServer.Val;
            AppConfig.PrimaryDNSServer.Val ^= AppConfig.SecondaryDNSServer.Val;

