Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/dns_client.c
            // Start another ARP resolution for the secondary server (now primary)
            vARPAttemptCount = 0;
            if (MySocket != INVALID_UDP_SOCKET) {
                UDPClose(MySocket);
                MySocket = INVALID_UDP_SOCKET;
            }
            smDNS = DNS_ARP_START_RESOLVE;
        }

        break;

    }

    return false;
}

/*****************************************************************************
  Function:
    static void DNSPutString(uint8_t *String)

  Summary:
    Writes a string to the DNS socket.

  Description:
    This function writes a string to the DNS socket, ensuring that it is
    properly formatted.

  Precondition:
    UDP socket is obtained and ready for writing.

  Parameters:
    String - the string to write to the UDP socket.

  Returns:
    None
 ***************************************************************************/
static void DNSPutString(uint8_t *String)
{
    uint8_t *RightPtr;
    uint8_t i;
    uint8_t Len;

    RightPtr = String;

    while (1) {
        do {
            i = *RightPtr++;
        } while ((i != 0x00u) && (i != '.') && (i != '/') && (i != ',') && (i != '>'));

        // Put the length and data
        // Also, skip over the '.' in the input string
        Len = (uint8_t) (RightPtr - String - 1);
        UDPPut(Len);
        String += UDPPutArray(String, Len) + 1;

        if (i == 0x00u || i == '/' || i == ',' || i == '>')
            break;
    }

    // Put the string null terminator character (zero length label)
    UDPPut(0x00);
}

/*****************************************************************************
  Function:
    static void DNSPutROMString(ROM uint8_t *String)

  Summary:
    Writes a ROM string to the DNS socket.

  Description:
    This function writes a string to the DNS socket, ensuring that it is
    properly formatted.

  Precondition:
    UDP socket is obtained and ready for writing.

  Parameters:
    String - the string to write to the UDP socket.

  Returns:
    None

  Remarks:
    This function is aliased to DNSPutString on non-PIC18 platforms.
 ***************************************************************************/
#if defined(__XC8)
static void DNSPutROMString(ROM uint8_t *String)
{
    ROM uint8_t *RightPtr;
    uint8_t i;
    uint8_t Len;

    RightPtr = String;

    while (1) {
        do {
            i = *RightPtr++;
        } while ((i != 0x00u) && (i != '.') && (i != '/') && (i != ',') && (i != '>'));

        // Put the length and data
        // Also, skip over the '.' in the input string
        Len = (uint8_t) (RightPtr - String - 1);
        UDPPut(Len);
        String += UDPPutROMArray(String, Len) + 1;

        if (i == 0x00u || i == '/' || i == ',' || i == '>')
            break;
    }

    // Put the string terminator character (zero length label)
    UDPPut(0x00);
}
#endif

/*****************************************************************************
  Function:
    static void DNSDiscardName(void)

  Summary:
    Reads a name string or string pointer from the DNS socket and discards it.

  Description:
    This function reads a name string from the DNS socket.  Each string
    consists of a series of labels.  Each label consists of a length prefix
    byte, followed by the label bytes.  At the end of the string, a zero length
    label is found as termination.  If name compression is used, this function
    will automatically detect the pointer and discard it.

  Precondition:
    UDP socket is obtained and ready for reading a DNS name

  Parameters:
    None

  Returns:
    None
 ***************************************************************************/
static void DNSDiscardName(void)
{
    uint8_t i;

    while (1) {
        // Get first byte which will tell us if this is a 16-bit pointer or the
        // length of the first of a series of labels
        if (!UDPGet(&i))
            return;

        // Check if this is a pointer, if so, get the reminaing 8 bits and return
        if ((i & 0xC0u) == 0xC0u) {
            UDPGet(&i);
            return;
        }

        // Exit once we reach a zero length label
        if (i == 0u)
            return;

        // Discard complete label
        UDPGetArray(NULL, i);
    }
}

#endif // #if defined(STACK_USE_DNS_CLIENT)
